MikroElektronika/core_packages/PIC/XC8/def/PIC12F1822/mcu.h
extern volatile PORTAbits_t PORTAbits __at(0x00C);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x4
#define _PORTA_AN3_POSITION                                 0x4
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x10
#define _PORTA_CPS0_POSN                                    0x0
#define _PORTA_CPS0_POSITION                                0x0
#define _PORTA_CPS0_SIZE                                    0x1
#define _PORTA_CPS0_LENGTH                                  0x1
#define _PORTA_CPS0_MASK                                    0x1
#define _PORTA_CPS1_POSN                                    0x1
#define _PORTA_CPS1_POSITION                                0x1
#define _PORTA_CPS1_SIZE                                    0x1
#define _PORTA_CPS1_LENGTH                                  0x1
#define _PORTA_CPS1_MASK                                    0x2
#define _PORTA_CPS2_POSN                                    0x2
#define _PORTA_CPS2_POSITION                                0x2
#define _PORTA_CPS2_SIZE                                    0x1
#define _PORTA_CPS2_LENGTH                                  0x1
#define _PORTA_CPS2_MASK                                    0x4
#define _PORTA_CPS3_POSN                                    0x4
#define _PORTA_CPS3_POSITION                                0x4
#define _PORTA_CPS3_SIZE                                    0x1
#define _PORTA_CPS3_LENGTH                                  0x1
#define _PORTA_CPS3_MASK                                    0x10
#define _PORTA_C1INP_POSN                                   0x0
#define _PORTA_C1INP_POSITION                               0x0
#define _PORTA_C1INP_SIZE                                   0x1
#define _PORTA_C1INP_LENGTH                                 0x1
#define _PORTA_C1INP_MASK                                   0x1
#define _PORTA_C1IN0N_POSN                                  0x1
#define _PORTA_C1IN0N_POSITION                              0x1
#define _PORTA_C1IN0N_SIZE                                  0x1
#define _PORTA_C1IN0N_LENGTH                                0x1
#define _PORTA_C1IN0N_MASK                                  0x2
#define _PORTA_C1OUT_POSN                                   0x2
#define _PORTA_C1OUT_POSITION                               0x2
#define _PORTA_C1OUT_SIZE                                   0x1
#define _PORTA_C1OUT_LENGTH                                 0x1
#define _PORTA_C1OUT_MASK                                   0x4
#define _PORTA_C1IN1N_POSN                                  0x4
#define _PORTA_C1IN1N_POSITION                              0x4
#define _PORTA_C1IN1N_SIZE                                  0x1
#define _PORTA_C1IN1N_LENGTH                                0x1
#define _PORTA_C1IN1N_MASK                                  0x10
#define _PORTA_DACOUT_POSN                                  0x0
#define _PORTA_DACOUT_POSITION                              0x0
#define _PORTA_DACOUT_SIZE                                  0x1
#define _PORTA_DACOUT_LENGTH                                0x1
#define _PORTA_DACOUT_MASK                                  0x1
#define _PORTA_SRI_POSN                                     0x1
#define _PORTA_SRI_POSITION                                 0x1
#define _PORTA_SRI_SIZE                                     0x1
#define _PORTA_SRI_LENGTH                                   0x1
#define _PORTA_SRI_MASK                                     0x2
#define _PORTA_SRQ_POSN                                     0x2
#define _PORTA_SRQ_POSITION                                 0x2
#define _PORTA_SRQ_SIZE                                     0x1
#define _PORTA_SRQ_LENGTH                                   0x1
#define _PORTA_SRQ_MASK                                     0x4
#define _PORTA_SRNQ_POSN                                    0x5
#define _PORTA_SRNQ_POSITION                                0x5
#define _PORTA_SRNQ_SIZE                                    0x1
#define _PORTA_SRNQ_LENGTH                                  0x1
#define _PORTA_SRNQ_MASK                                    0x20
#define _PORTA_SCK_POSN                                     0x1
#define _PORTA_SCK_POSITION                                 0x1
#define _PORTA_SCK_SIZE                                     0x1
#define _PORTA_SCK_LENGTH                                   0x1
#define _PORTA_SCK_MASK                                     0x2
#define _PORTA_T0CKI_POSN                                   0x2
#define _PORTA_T0CKI_POSITION                               0x2
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x4
#define _PORTA_T1OSO_POSN                                   0x4
#define _PORTA_T1OSO_POSITION                               0x4
#define _PORTA_T1OSO_SIZE                                   0x1
#define _PORTA_T1OSO_LENGTH                                 0x1
#define _PORTA_T1OSO_MASK                                   0x10
#define _PORTA_T1CKI_POSN                                   0x5
#define _PORTA_T1CKI_POSITION                               0x5
#define _PORTA_T1CKI_SIZE                                   0x1
#define _PORTA_T1CKI_LENGTH                                 0x1
#define _PORTA_T1CKI_MASK                                   0x20
#define _PORTA_SCL_POSN                                     0x1
#define _PORTA_SCL_POSITION                                 0x1
#define _PORTA_SCL_SIZE                                     0x1
#define _PORTA_SCL_LENGTH                                   0x1
#define _PORTA_SCL_MASK                                     0x2
#define _PORTA_SDA_POSN                                     0x2
#define _PORTA_SDA_POSITION                                 0x2
#define _PORTA_SDA_SIZE                                     0x1
#define _PORTA_SDA_LENGTH                                   0x1
#define _PORTA_SDA_MASK                                     0x4
#define _PORTA_nMCLR_POSN                                   0x3
#define _PORTA_nMCLR_POSITION                               0x3
#define _PORTA_nMCLR_SIZE                                   0x1
#define _PORTA_nMCLR_LENGTH                                 0x1
#define _PORTA_nMCLR_MASK                                   0x8
#define _PORTA_CLKR_POSN                                    0x4
#define _PORTA_CLKR_POSITION                                0x4
#define _PORTA_CLKR_SIZE                                    0x1
#define _PORTA_CLKR_LENGTH                                  0x1
#define _PORTA_CLKR_MASK                                    0x10
#define _PORTA_T1OSI_POSN                                   0x5
#define _PORTA_T1OSI_POSITION                               0x5
#define _PORTA_T1OSI_SIZE                                   0x1
#define _PORTA_T1OSI_LENGTH                                 0x1
#define _PORTA_T1OSI_MASK                                   0x20
#define _PORTA_MDOUT_POSN                                   0x0
#define _PORTA_MDOUT_POSITION                               0x0
#define _PORTA_MDOUT_SIZE                                   0x1
#define _PORTA_MDOUT_LENGTH                                 0x1
#define _PORTA_MDOUT_MASK                                   0x1
#define _PORTA_MDMIN_POSN                                   0x1
#define _PORTA_MDMIN_POSITION                               0x1
#define _PORTA_MDMIN_SIZE                                   0x1
#define _PORTA_MDMIN_LENGTH                                 0x1
#define _PORTA_MDMIN_MASK                                   0x2
#define _PORTA_MDCIN1_POSN                                  0x2
#define _PORTA_MDCIN1_POSITION                              0x2
#define _PORTA_MDCIN1_SIZE                                  0x1
#define _PORTA_MDCIN1_LENGTH                                0x1
#define _PORTA_MDCIN1_MASK                                  0x4
#define _PORTA_MDCIN2_POSN                                  0x4
#define _PORTA_MDCIN2_POSITION                              0x4
#define _PORTA_MDCIN2_SIZE                                  0x1
#define _PORTA_MDCIN2_LENGTH                                0x1
#define _PORTA_MDCIN2_MASK                                  0x10
#define _PORTA_SDI_POSN                                     0x2
#define _PORTA_SDI_POSITION                                 0x2
#define _PORTA_SDI_SIZE                                     0x1
#define _PORTA_SDI_LENGTH                                   0x1
#define _PORTA_SDI_MASK                                     0x4
#define _PORTA_OSC2_POSN                                    0x4
#define _PORTA_OSC2_POSITION                                0x4
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x10
#define _PORTA_OSC1_POSN                                    0x5
#define _PORTA_OSC1_POSITION                                0x5
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x20
#define _PORTA_FLT0_POSN                                    0x2
#define _PORTA_FLT0_POSITION                                0x2
#define _PORTA_FLT0_SIZE                                    0x1
#define _PORTA_FLT0_LENGTH                                  0x1
#define _PORTA_FLT0_MASK                                    0x4
#define _PORTA_CLKOUT_POSN                                  0x4
#define _PORTA_CLKOUT_POSITION                              0x4
#define _PORTA_CLKOUT_SIZE                                  0x1
#define _PORTA_CLKOUT_LENGTH                                0x1
#define _PORTA_CLKOUT_MASK                                  0x10
#define _PORTA_CLKIN_POSN                                   0x5
#define _PORTA_CLKIN_POSITION                               0x5
#define _PORTA_CLKIN_SIZE                                   0x1
#define _PORTA_CLKIN_LENGTH                                 0x1
#define _PORTA_CLKIN_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x011);
#ifndef _LIB_BUILD
asm("PIR1 equ 011h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned SSP1IF                 :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
        unsigned ADIF                   :1;
        unsigned TMR1GIF                :1;
    };
} PIR1bits_t;
