MikroElektronika/core_packages/PIC/XC8/def/PIC12F1822/mcu.h
extern volatile SRCON1bits_t SRCON1bits __at(0x11B);
// bitfield macros
#define _SRCON1_SRRC1E_POSN                                 0x0
#define _SRCON1_SRRC1E_POSITION                             0x0
#define _SRCON1_SRRC1E_SIZE                                 0x1
#define _SRCON1_SRRC1E_LENGTH                               0x1
#define _SRCON1_SRRC1E_MASK                                 0x1
#define _SRCON1_SRRCKE_POSN                                 0x2
#define _SRCON1_SRRCKE_POSITION                             0x2
#define _SRCON1_SRRCKE_SIZE                                 0x1
#define _SRCON1_SRRCKE_LENGTH                               0x1
#define _SRCON1_SRRCKE_MASK                                 0x4
#define _SRCON1_SRRPE_POSN                                  0x3
#define _SRCON1_SRRPE_POSITION                              0x3
#define _SRCON1_SRRPE_SIZE                                  0x1
#define _SRCON1_SRRPE_LENGTH                                0x1
#define _SRCON1_SRRPE_MASK                                  0x8
#define _SRCON1_SRSC1E_POSN                                 0x4
#define _SRCON1_SRSC1E_POSITION                             0x4
#define _SRCON1_SRSC1E_SIZE                                 0x1
#define _SRCON1_SRSC1E_LENGTH                               0x1
#define _SRCON1_SRSC1E_MASK                                 0x10
#define _SRCON1_SRSCKE_POSN                                 0x6
#define _SRCON1_SRSCKE_POSITION                             0x6
#define _SRCON1_SRSCKE_SIZE                                 0x1
#define _SRCON1_SRSCKE_LENGTH                               0x1
#define _SRCON1_SRSCKE_MASK                                 0x40
#define _SRCON1_SRSPE_POSN                                  0x7
#define _SRCON1_SRSPE_POSITION                              0x7
#define _SRCON1_SRSPE_SIZE                                  0x1
#define _SRCON1_SRSPE_LENGTH                                0x1
#define _SRCON1_SRSPE_MASK                                  0x80

// Register: APFCON
#define APFCON APFCON
extern volatile unsigned char           APFCON              __at(0x11D);
#ifndef _LIB_BUILD
asm("APFCON equ 011Dh");
#endif
// aliases
extern volatile unsigned char           APFCON0             __at(0x11D);
#ifndef _LIB_BUILD
asm("APFCON0 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1SEL                :1;
        unsigned P1BSEL                 :1;
        unsigned TXCKSEL                :1;
        unsigned T1GSEL                 :1;
        unsigned                        :1;
        unsigned SSSEL                  :1;
        unsigned SDOSEL                 :1;
        unsigned RXDTSEL                :1;
    };
    struct {
        unsigned                        :5;
        unsigned SS1SEL                 :1;
        unsigned SDO1SEL                :1;
    };
} APFCONbits_t;
extern volatile APFCONbits_t APFCONbits __at(0x11D);
// bitfield macros
#define _APFCON_CCP1SEL_POSN                                0x0
#define _APFCON_CCP1SEL_POSITION                            0x0
#define _APFCON_CCP1SEL_SIZE                                0x1
#define _APFCON_CCP1SEL_LENGTH                              0x1
#define _APFCON_CCP1SEL_MASK                                0x1
#define _APFCON_P1BSEL_POSN                                 0x1
#define _APFCON_P1BSEL_POSITION                             0x1
#define _APFCON_P1BSEL_SIZE                                 0x1
#define _APFCON_P1BSEL_LENGTH                               0x1
#define _APFCON_P1BSEL_MASK                                 0x2
#define _APFCON_TXCKSEL_POSN                                0x2
#define _APFCON_TXCKSEL_POSITION                            0x2
#define _APFCON_TXCKSEL_SIZE                                0x1
#define _APFCON_TXCKSEL_LENGTH                              0x1
#define _APFCON_TXCKSEL_MASK                                0x4
#define _APFCON_T1GSEL_POSN                                 0x3
#define _APFCON_T1GSEL_POSITION                             0x3
#define _APFCON_T1GSEL_SIZE                                 0x1
#define _APFCON_T1GSEL_LENGTH                               0x1
#define _APFCON_T1GSEL_MASK                                 0x8
#define _APFCON_SSSEL_POSN                                  0x5
#define _APFCON_SSSEL_POSITION                              0x5
#define _APFCON_SSSEL_SIZE                                  0x1
#define _APFCON_SSSEL_LENGTH                                0x1
#define _APFCON_SSSEL_MASK                                  0x20
#define _APFCON_SDOSEL_POSN                                 0x6
#define _APFCON_SDOSEL_POSITION                             0x6
#define _APFCON_SDOSEL_SIZE                                 0x1
#define _APFCON_SDOSEL_LENGTH                               0x1
#define _APFCON_SDOSEL_MASK                                 0x40
#define _APFCON_RXDTSEL_POSN                                0x7
#define _APFCON_RXDTSEL_POSITION                            0x7
#define _APFCON_RXDTSEL_SIZE                                0x1
#define _APFCON_RXDTSEL_LENGTH                              0x1
#define _APFCON_RXDTSEL_MASK                                0x80
#define _APFCON_SS1SEL_POSN                                 0x5
#define _APFCON_SS1SEL_POSITION                             0x5
#define _APFCON_SS1SEL_SIZE                                 0x1
#define _APFCON_SS1SEL_LENGTH                               0x1
#define _APFCON_SS1SEL_MASK                                 0x20
#define _APFCON_SDO1SEL_POSN                                0x6
#define _APFCON_SDO1SEL_POSITION                            0x6
#define _APFCON_SDO1SEL_SIZE                                0x1
#define _APFCON_SDO1SEL_LENGTH                              0x1
#define _APFCON_SDO1SEL_MASK                                0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned CCP1SEL                :1;
        unsigned P1BSEL                 :1;
        unsigned TXCKSEL                :1;
        unsigned T1GSEL                 :1;
        unsigned                        :1;
        unsigned SSSEL                  :1;
        unsigned SDOSEL                 :1;
        unsigned RXDTSEL                :1;
    };
    struct {
        unsigned                        :5;
        unsigned SS1SEL                 :1;
        unsigned SDO1SEL                :1;
    };
} APFCON0bits_t;
extern volatile APFCON0bits_t APFCON0bits __at(0x11D);
// bitfield macros
#define _APFCON0_CCP1SEL_POSN                               0x0
#define _APFCON0_CCP1SEL_POSITION                           0x0
#define _APFCON0_CCP1SEL_SIZE                               0x1
#define _APFCON0_CCP1SEL_LENGTH                             0x1
#define _APFCON0_CCP1SEL_MASK                               0x1
#define _APFCON0_P1BSEL_POSN                                0x1
#define _APFCON0_P1BSEL_POSITION                            0x1
#define _APFCON0_P1BSEL_SIZE                                0x1
#define _APFCON0_P1BSEL_LENGTH                              0x1
#define _APFCON0_P1BSEL_MASK                                0x2
#define _APFCON0_TXCKSEL_POSN                               0x2
#define _APFCON0_TXCKSEL_POSITION                           0x2
#define _APFCON0_TXCKSEL_SIZE                               0x1
#define _APFCON0_TXCKSEL_LENGTH                             0x1
#define _APFCON0_TXCKSEL_MASK                               0x4
#define _APFCON0_T1GSEL_POSN                                0x3
#define _APFCON0_T1GSEL_POSITION                            0x3
#define _APFCON0_T1GSEL_SIZE                                0x1
#define _APFCON0_T1GSEL_LENGTH                              0x1
#define _APFCON0_T1GSEL_MASK                                0x8
#define _APFCON0_SSSEL_POSN                                 0x5
#define _APFCON0_SSSEL_POSITION                             0x5
#define _APFCON0_SSSEL_SIZE                                 0x1
#define _APFCON0_SSSEL_LENGTH                               0x1
#define _APFCON0_SSSEL_MASK                                 0x20
#define _APFCON0_SDOSEL_POSN                                0x6
#define _APFCON0_SDOSEL_POSITION                            0x6
#define _APFCON0_SDOSEL_SIZE                                0x1
#define _APFCON0_SDOSEL_LENGTH                              0x1
#define _APFCON0_SDOSEL_MASK                                0x40
#define _APFCON0_RXDTSEL_POSN                               0x7
#define _APFCON0_RXDTSEL_POSITION                           0x7
#define _APFCON0_RXDTSEL_SIZE                               0x1
#define _APFCON0_RXDTSEL_LENGTH                             0x1
#define _APFCON0_RXDTSEL_MASK                               0x80
#define _APFCON0_SS1SEL_POSN                                0x5
#define _APFCON0_SS1SEL_POSITION                            0x5
#define _APFCON0_SS1SEL_SIZE                                0x1
#define _APFCON0_SS1SEL_LENGTH                              0x1
#define _APFCON0_SS1SEL_MASK                                0x20
#define _APFCON0_SDO1SEL_POSN                               0x6
#define _APFCON0_SDO1SEL_POSITION                           0x6
#define _APFCON0_SDO1SEL_SIZE                               0x1
#define _APFCON0_SDO1SEL_LENGTH                             0x1
#define _APFCON0_SDO1SEL_MASK                               0x40

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x18C);
#ifndef _LIB_BUILD
asm("ANSELA equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
    };
    struct {
        unsigned ANSELA                 :5;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x18C);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSELA_POSN                                 0x0
#define _ANSELA_ANSELA_POSITION                             0x0
#define _ANSELA_ANSELA_SIZE                                 0x5
#define _ANSELA_ANSELA_LENGTH                               0x5
#define _ANSELA_ANSELA_MASK                                 0x1F

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned short          EEADR               __at(0x191);
#ifndef _LIB_BUILD
asm("EEADR equ 0191h");
#endif

// Register: EEADRL
#define EEADRL EEADRL
extern volatile unsigned char           EEADRL              __at(0x191);
#ifndef _LIB_BUILD
asm("EEADRL equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRL                 :8;
    };
} EEADRLbits_t;
extern volatile EEADRLbits_t EEADRLbits __at(0x191);
// bitfield macros
#define _EEADRL_EEADRL_POSN                                 0x0
#define _EEADRL_EEADRL_POSITION                             0x0
#define _EEADRL_EEADRL_SIZE                                 0x8
#define _EEADRL_EEADRL_LENGTH                               0x8
#define _EEADRL_EEADRL_MASK                                 0xFF

// Register: EEADRH
#define EEADRH EEADRH
extern volatile unsigned char           EEADRH              __at(0x192);
#ifndef _LIB_BUILD
asm("EEADRH equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRH                 :7;
    };
} EEADRHbits_t;
